src/cf/Catalogs/УзлыКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УзлыКОД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРежимеВосстановления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницаАктуальностиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецИнтервалаВосстановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоИнтервалаВосстановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПолучатьДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПриложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервисов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксШтрихкода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПриложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверСервисов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаПриложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаСервисов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ГраницаПереносаИсторическихДанныхКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГраницаПереносаИсторическихДанныхКОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГраницаОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиТранспортаКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиТранспортаКОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияУзловКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияУзловКОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаОстановкиОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГраницаПереносаИсторическихДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГраницаПереносаНСИ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменОстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияПотоковКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыТранспортаКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаКОД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTPСервер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НаправленияПотоковКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияПотоковКОД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/УзлыКОД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВидТранспорта = Перечисления.ВидыТранспортаКОД.ОбщийКаталог;
		Объект.Версия = КОДСервер.ТекущаяВерсияФормата();
		ИдентификаторСтрокой = Новый УникальныйИдентификатор();
	Иначе
		ПрочитатьНастройкиТранспорта();
	КонецЕсли;
	
	ЭтотУзел = ПредопределенноеЗначение("Справочник.УзлыКОД.ЭтотУзел");
	РодительЭтогоУзла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотУзел, "Родитель");
	
	Элементы.СтраницыВидовТранспорта.ТекущаяСтраница =
		?(ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаКОД.FTPСервер"),
			Элементы.СтраницаFTPСервер,
			Элементы.СтраницаОбщийКаталог);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ГраницаПереносаИсторическихДанныхКОД.Узел КАК Узел
		|ИЗ
		|	РегистрСведений.ГраницаПереносаИсторическихДанныхКОД КАК ГраницаПереносаИсторическихДанныхКОД
		|ГДЕ
		|	ГраницаПереносаИсторическихДанныхКОД.Узел = &Узел
		|	И ГраницаПереносаИсторическихДанныхКОД.Граница <> 0");
	Запрос.УстановитьПараметр("Узел", Объект.Ссылка);
	МиграцияИсторическихДанныхВыполняется = Не Запрос.Выполнить().Пустой();
	
	Если Объект.Ссылка = ЭтотУзел Тогда
		ПрефиксИБ = Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить();
		Если ЗначениеЗаполнено(ПрефиксИБ) И Объект.Код <> ПрефиксИБ Тогда
			Объект.Код = ПрефиксИБ;
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'В качестве кода узла установлен префикс информационной базы.'"));
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовФормы(ЭтотОбъект);
	
	ОбновитьСведенияОбОстановке();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИдентификаторСтрокой = Строка(Объект.Ссылка.УникальныйИдентификатор());
	Иначе
		Если ЗначениеЗаполнено(ЭтотУзел) Тогда
			Элементы.ИдентификаторСтрокой.ТолькоПросмотр = Ложь;
		Иначе
			ИдентификаторСтрокой = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПрочитатьНастройкиТранспорта();
	ПрочитатьНастройкиАвторизацииВСервисе(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаКОД.FTPСервер") Тогда
		Если Не СтрНачинаетсяС(Ресурс, "ftp://") Тогда
			Отказ = Истина;
			ПоказатьПредупреждение(, НСтр("ru = 'FTP-ресурс должен начинаться с ftp://'"));
		ИначеЕсли СтрНайти(Ресурс, "/", НаправлениеПоиска.СНачала, 7) = 0 Тогда
			Отказ = Истина;
			ПоказатьПредупреждение(, НСтр("ru = 'FTP-ресурс должен содержать путь на сервере'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Код) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указан код узла'"),
			Объект.Ссылка,
			,
			"Объект.Код",
			Отказ);
	КонецЕсли;
	
	Если Объект.Ссылка <> ЭтотУзел И Не ЗначениеЗаполнено(ОбщийКаталог) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указан путь к каталогу обмена'"),
			,
			"ОбщийКаталог",
			,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторСтрокой) Тогда
			ВызватьИсключение НСтр("ru = 'Не указан идентификатор.'")
		КонецЕсли;
		
		Попытка
			НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор(ИдентификаторСтрокой)
		Исключение
			ВызватьИсключение СтрШаблон(
				НСтр("ru = '%1 - не является уникальным идентификатором.'"),
				ИдентификаторСтрокой);
		КонецПопытки;
		
		ТекущийОбъект.УстановитьСсылкуНового(Справочники.УзлыКОД.ПолучитьСсылку(НовыйУникальныйИдентификатор));
		ПараметрыЗаписи.Вставить("ЭтоНовый", Истина);
	Иначе
		ПараметрыЗаписи.Вставить("ЭтоНовый", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНастройкиТранспорта();
	ЗаписатьНастройкиАвторизацииВСервисе(ТекущийОбъект.Ссылка);
	
	Если Объект.Ссылка = ЭтотУзел Тогда
		КОДСлужебный.ПереименоватьПоставляемогоАдминистратора();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КОД_ИзменениеСтатусаОстановлен" И Параметр = Объект.Ссылка Тогда
		ОбновитьСведенияОбОстановке();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТранспортаПриИзменении(Элемент)
	
	Элементы.СтраницыВидовТранспорта.ТекущаяСтраница =
		?(ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаКОД.FTPСервер"),
			Элементы.СтраницаFTPСервер,
			Элементы.СтраницаОбщийКаталог);
			
	Если ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаКОД.FTPСервер") И Порт = 0 Тогда
		Порт = 21;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийКаталогОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложениеАсинх(ОбщийКаталог);
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Объект.ПрефиксШтрихкода = ОбщегоНазначенияДокументооборотКлиентСервер.СтрокаВЧисло(Объект.Код);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройкиТранспорта()
	
	НастройкиТранспортаУзла =
		РегистрыСведений.НастройкиТранспортаКОД.ПрочитатьНастройкиТранспортаУзла(Объект.Ссылка);
		
	ВидТранспорта =
		?(Не ЗначениеЗаполнено(НастройкиТранспортаУзла.ВидТранспорта),
			Перечисления.ВидыТранспортаКОД.ОбщийКаталог,
			НастройкиТранспортаУзла.ВидТранспорта);
	
	ЗаполнитьЗначенияСвойств(
		ЭтотОбъект,
		НастройкиТранспортаУзла.Настройки,
		"ОбщийКаталог, Ресурс, Порт, ПассивныйРежим, Пользователь, Пароль");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиТранспорта()
	
	НастройкиТранспортаУзла =
		РегистрыСведений.НастройкиТранспортаКОД.ОписаниеСтруктурыНастроек();
		
	НастройкиТранспортаУзла.ВидТранспорта = ВидТранспорта;
	ЗаполнитьЗначенияСвойств(
		НастройкиТранспортаУзла.Настройки,
		ЭтотОбъект,
		"ОбщийКаталог, Ресурс, Порт, ПассивныйРежим, Пользователь, Пароль");
		
	РегистрыСведений.НастройкиТранспортаКОД.ЗаписатьНастройкиТранспортаУзла(
		Объект.Ссылка, НастройкиТранспортаУзла);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиАвторизацииВСервисе(Ссылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиАвторизации = Справочники.УзлыКОД.НастройкиАвторизацииВСервисе(Ссылка);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиАвторизации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиАвторизацииВСервисе(Ссылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		Ссылка, ИмяПользователяСервиса, "ИмяПользователяСервиса");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		Ссылка, ПарольПользователяСервиса, "ПарольПользователяСервиса");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементовФормы(Форма)
	
	Объект = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;
	
	Если Объект.Родитель = Форма.ЭтотУзел Тогда
		ЭлементыФормы.НастройкиТранспорта.Видимость = Истина;
		ЭлементыФормы.НастройкиПодразделений.Видимость = Истина;
		ЭлементыФормы.ФормаПереносИсторическихДанных.Доступность =
			Не Форма.МиграцияИсторическихДанныхВыполняется;
		
		Форма.КлючСохраненияПоложенияОкна = "СоВсемиНастройками";
	ИначеЕсли Объект.Ссылка = Форма.РодительЭтогоУзла Тогда
		ЭлементыФормы.НастройкиТранспорта.Видимость = Истина;
		ЭлементыФормы.НастройкиПодразделений.Видимость = Ложь;
		ЭлементыФормы.ФормаПереносИсторическихДанных.Видимость = Ложь;
		ЭлементыФормы.ФормаНеОтправлятьНеПолучатьДанные.Видимость = Ложь;
		
		Форма.КлючСохраненияПоложенияОкна = "СНастройкамиТранспорта";
	ИначеЕсли Объект.Ссылка = Форма.ЭтотУзел Тогда
		ЭлементыФормы.НастройкиТранспорта.Видимость = Ложь;
		ЭлементыФормы.НастройкиПодразделений.Видимость =
			ЗначениеЗаполнено(Объект.Родитель);
		ЭлементыФормы.ФормаНеОтправлятьНеПолучатьДанные.Видимость =
			ЗначениеЗаполнено(Объект.Родитель);
		ЭлементыФормы.КомандаОстановитьОперативнуюОтправку.Доступность = Ложь;
		ЭлементыФормы.КомандаОстановитьОперативнуюПриемку.Доступность = Ложь;
		ЭлементыФормы.ФормаПереносИсторическихДанных.Видимость = Ложь;
		
		Форма.КлючСохраненияПоложенияОкна = "СНастройкамиПодразделений";
	Иначе
		ЭлементыФормы.НастройкиТранспорта.Видимость = Ложь;
		ЭлементыФормы.НастройкиПодразделений.Видимость = Ложь;
		ЭлементыФормы.ФормаНеОтправлятьНеПолучатьДанные.Видимость = Ложь;
		ЭлементыФормы.ФормаПереносИсторическихДанных.Видимость = Ложь;
		
		Форма.КлючСохраненияПоложенияОкна = "БезНастроек";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОбОстановке()
	
	НеОтправлятьДанные = РегистрыСведений.СостоянияУзловКОД.ОбменСУзломОстановлен(
		Объект.Ссылка, Перечисления.НаправленияПотоковКОД.Отправка);
	НеПолучатьДанные = РегистрыСведений.СостоянияУзловКОД.ОбменСУзломОстановлен(
		Объект.Ссылка, Перечисления.НаправленияПотоковКОД.Получение);
	
	Если НеОтправлятьДанные Тогда
		Элементы.КомандаОстановитьОперативнуюОтправку.Заголовок =
			Нстр("ru = 'Возобновить отправку оперативных данных'");
		Элементы.КомандаОстановитьОперативнуюОтправку.Картинка = БиблиотекаКартинок.ЗнакВыполнить;
	Иначе
		Элементы.КомандаОстановитьОперативнуюОтправку.Заголовок =
			Нстр("ru = 'Остановить отправку оперативных данных'");
		Элементы.КомандаОстановитьОперативнуюОтправку.Картинка = БиблиотекаКартинок.ЗнакПауза;
	КонецЕсли;
	
	Если НеПолучатьДанные Тогда
		Элементы.КомандаОстановитьОперативнуюПриемку.Заголовок =
			Нстр("ru = 'Возобновить получение оперативных данных'");
		Элементы.КомандаОстановитьОперативнуюПриемку.Картинка = БиблиотекаКартинок.ЗнакВыполнить;
	Иначе
		Элементы.КомандаОстановитьОперативнуюПриемку.Заголовок =
			Нстр("ru = 'Остановить получение оперативных данных'");
		Элементы.КомандаОстановитьОперативнуюПриемку.Картинка = БиблиотекаКартинок.ЗнакПауза;
	КонецЕсли;
	
	Если НеОтправлятьДанные И НеПолучатьДанные Тогда
		Элементы.ОтметкаОстановлен.Заголовок =
			Нстр("ru = 'Остановлена приемка и отправка оперативных данных'");
	ИначеЕсли НеОтправлятьДанные Тогда
		Элементы.ОтметкаОстановлен.Заголовок =
			Нстр("ru = 'Остановлена отправка оперативных данных'");
	ИначеЕсли НеПолучатьДанные Тогда
		Элементы.ОтметкаОстановлен.Заголовок =
			Нстр("ru = 'Остановлено получение оперативных данных'");
	КонецЕсли;
	
	Элементы.ГруппаОбменОстановлен.Видимость = НеОтправлятьДанные Или НеПолучатьДанные;
	
КонецПроцедуры

#КонецОбласти
